<?php

// 1.5 Вывести на одной строке числа 1, 13 и 49 с одним пробелом между ними.
echo '<h2>1.5</h2>';
echo 1 . ' ' . 13 . ' ' . 49;
echo '<hr>';

// 1.6 Вывести на одной строке числа 7, 15 и 100 с двумя пробелами между ними.
echo '<h2>1.6</h2>';
echo 7 . ' &nbsp;' . 15 . ' &nbsp;' . 100;
echo '<hr>';

// 1.7 Составить программу вывода на экран в одну строку трех любых чисел с двумя пробелами между ними.
echo '<h2>1.7</h2>';
echo rand(0, 100) . ' &nbsp;' . rand(0, 100) . ' &nbsp;' . rand(0, 100);
echo '<hr>';

// 1.8 Составить программу вывода на экран в одну строку четырех любых чисел с одним пробелом между ними.
echo '<h2>1.8</h2>';
echo rand(0, 100) . ' ' . rand(0, 100) . ' ' . rand(0, 100) . ' ' . rand(0, 100);
echo '<hr>';

// 1.9 Вывести на экран числа 50 и 10 одно под другим.
echo '<h2>1.9</h2>';
echo 50 . '<br>' . 10;
echo '<hr>';

// 1.10 Вывести на экран числа 5, 10 и 21 одно под другим.
echo '<h2>1.10</h2>';
echo 5 . '<br>' . 10 . '<br>' . 21;
echo '<hr>';

// 1.11 Составить программу вывода на экран "столбиком" четырех любых чисел.
echo '<h2>1.11</h2>';
echo rand(0, 100) . '<br>' . rand(0, 100) . '<br>' . rand(0, 100) . '<br>' . rand(0, 100);
echo '<hr>';


// 1.12 Составить программу вывода на экран следующей информации:
$t = rand(0, 100);
$v = rand(0, 100);
$x = rand(0, 100);
$y = rand(0, 100);

echo '<h2>1.12</h2>';
echo 'a)<br>5 10<br>7 см';
echo '<br><br>';
echo 'б)<br>100 ' . $t . '<br>' . '1949 ' . $v;
echo '<br><br>';
echo 'в)<br>' . $x . ' 25<br>' . $x . ' ' .$y;
echo '<br><br>';

echo '<hr>';

// 1.13 Составить программу вывода на экран следующей информации:
$a = rand(1, 100);
$b = rand(1, 100);

echo '<h2>1.13</h2>';
echo 'а)<br> 2 кг<br>' . '20 15';
echo '<br><br>';
echo 'б)<br>' . $a . ' 1<br>19 ' . $b;
echo '<br><br>';
echo 'б)<br>' . $x . ' ' . $y . '<br>' . '5 ' . $y;
echo '<hr>';

// 1.15 Получить линейную запись следующих выражений:
$c = rand(1, 100);
$m = rand(1, 5);
$n = rand(1, 5);

echo '<h2>1.15</h2>';
echo 'a) ';
echo -1/($x**2);

echo '<br> б) ';
echo $a/($b*$c);

echo '<br> в) ';
echo $a/$b*$c;

echo '<br> г) ';
echo ($a+$b)/$c;

echo '<br> д) ';
echo 5.45 * (($a + 2 * $b) / (2 - $a));

echo '<br> е) ';
echo (-$b + sqrt(($b**2) - (4 * $a * $c))) / (2 * $a);

echo '<br> ж) ';
echo (-$b + 1/$a) / (2/$c);

echo '<br> з) ';
echo 1 / (1 + ($a+$b) / 2);

echo '<br>и) ';
echo 1 / (1 + (1 / (2 + (1 / (2 + (3/5))))));

echo '<br>к)';
echo (2**$m)**$n;

echo '<hr>';

// 1.16 Перевести из линейной записи в обычную следующие выражения:
$r = rand(1, 100);
$d = rand(1, 100);

echo '<h2>1.16</h2>';
echo 'a) ';
echo $a / $b / $c;

echo '<br> б) ';
echo $a * $b / $c;

echo '<br> в) ';
echo $a/$b*$c;

echo '<br> г) ';
echo $a + $b/$c;

echo '<br> д) ';
echo $a + $b / $c;

echo '<br> е) ';
echo $a + $b/$b + $c;

echo '<br> ж) ';
echo $a + $b/$b + $c;

echo '<br> з) ';
echo $a / sin($b);

echo '<br>и) ';
echo 1/2*$a*$b*sin($x);

echo '<br>к)';
echo 2*$b*$c*cos($a)/2/$b+$c;

echo '<br>л)';
echo 4 * $r * sin($a / 2) * sin($b/2) * sin($c/2);

echo '<br>м)';
echo $a * $x + $b / $c * $x + $d;

echo '<br>н)';
echo 2 * sin($a + $b) / 2 * cos($a-$b) / 2;

echo '<br>о)';
echo abs(2) * sin(-3) * abs($x/2);

echo '<hr>';

//1.19 Указать значение величины x после выполнения следующих операторов присваивания:
echo '<h2>1.19</h2>';

$x = rand(0, 100);
echo 'а)<br>';
$x = 10;
echo $x . '<br>';
$x = -10;
echo $x . '<br>';

$x = rand(0, 100);
echo 'б)<br>';
$x = 17.5;
echo $x . '<br>';
$x = -2 * $x;
echo $x . '<br>';

$x = rand(0, 100);
echo 'в)<br>';
$x = 60;
echo $x . '<br>';
$x = $x - 1;
echo $x . '<br>';
$x = 0;
echo $x . '<br>';

$x = rand(0, 100);
$k = rand(0, 100);
echo 'г)<br>';
$x = -50;
echo $x . '<br>';
$x = -25;
echo $x . '<br>';
$x = $x + $k;
echo $x . '<br>';

echo '<hr>';

// 1.22

echo '<h2>1.22</h2>';
$x = rand(1, 100);
$a = rand(1, 100);

$y = 7 * $x**2 - 3*$x + 6;
echo 'а) ' . $y . '<br>';

$x = 12 * $a**2 + 7 * $a - 16;
echo 'б) ' . $x . '<br>';
echo '<hr>';
// 1.60 Составить программу обмена значениями трех переменных величин а, b, c по следующей схеме:
echo '<h2>1.60</h2>';

$a = rand(0, 30);
$b = rand(0, 30);
$c = rand(0, 30);

echo '<h4>а)До перестановки</h4>';
echo '$a = ' . $a . ';<br>';
echo '$b = ' . $b . ';<br>';
echo '$c = ' . $c . ';<br>';
echo '<h4>После перестановки</h4>';
$temp1 = $b;
$temp2 = $a;
$b = $c;
$a = $temp1;
$c = $temp2;



echo '$a = ' . $a . ';<br>';
echo '$b = ' . $b . ';<br>';
echo '$c = ' . $c . ';<br>';



$a = rand(0, 30);
$b = rand(0, 30);
$c = rand(0, 30);

echo '<h4>б)До перестановки</h4>';
echo '$a = ' . $a . ';<br>';
echo '$b = ' . $b . ';<br>';
echo '$c = ' . $c . ';<br>';
echo '<h4>После перестановки</h4>';
$temp1 = $b;
$temp2 = $c;
$b = $a;
$c = $temp1;
$a = $temp2;



echo '$a = ' . $a . ';<br>';
echo '$b = ' . $b . ';<br>';
echo '$c = ' . $c . ';<br>';

echo '<hr>';

// 1.61 Дано вещественное число а. Пользуясь только операцией умножения, получить:

echo '<h2>1.61</h2>';

$a = rand(1, 10);

$a = $a * $a;
$a = $a * $a;

echo 'а) ' . $a . '<br>';

$a = rand(1, 10);
$a = $a * $a; //2-я
$b = $a * $a; //4-я
$a = $a * $b; //6-я

echo 'б) ' . $a . '<br>';

$a = rand(1, 10);
$b = $a * $a; //2-я
$c = $b * $b; //4-я
$b = $c * $b; //6-я
$a = $a * $b; //7-я

echo 'в) ' . $a . '<br>';

$a = rand(1, 10);
$a = $a * $a; //2-я степень
$a = $a * $a; //4-я
$a = $a * $a; //8-я

echo 'г) ' . $a . '<br>';

$a = rand(1, 10);
$b = $a * $a; //2-я степень
$b = $b * $b; //4-я
$b = $b * $b; //8-я
$a = $a * $b; //9

echo 'д) ' . $a . '<br>';

$a = rand(1, 10);
$b = $a * $a; //2-я степень
$a = $b * $b; //4-я
$a = $a * $a; //8-я
$a = $a * $b; //10

echo 'е) ' . $a . '<br>';

$a = rand(1, 10);
$b = $a * $a; //2-я степень
$c = $b * $b; //4-я
$d = $c * $c; //8-я
$c = $d * $b; //12
$a = $a * $c; //13

echo 'ж) ' . $a . '<br>';

$a = rand(1, 10);
$b = $a * $a; //2
$c = $b * $a; //3
$d = $c * $c; //6
$e = $d * $d; //12
$a = $c * $e; //15

echo 'з) ' . $a . '<br>';

$a = rand(1, 10);
$b = $a * $a; //2
$c = $b * $b; //4
$d = $c * $c; //8
$e = $d * $d; //16
$b = $e * $c; //20
$a = $b * $a; //21

echo 'и) ' . $a . '<br>';

$a = rand(1, 10);
$b = $a * $a; //2
$c = $b * $b; //4
$d = $c * $c; //8
$e = $d * $d; //16
$b = $e * $d; //24
$a = $b * $c; //28

echo 'к) ' . $a . '<br>';

$a = rand(1, 10);
$a = $a * $a; //2
$a = $a * $a; //4
$a = $a * $a; //8
$a = $a * $a; //16
$a = $a * $a; //32
$a = $a * $a; //64
echo 'л) ' . $a . '<br>';

echo '<hr>';

// 2.1 Дано расстояние в сантиметрах. Найти число полных метров в нем.
echo '<h2>2.1</h2>';
$sm = rand(0,10000);

$m = $sm / 100;
echo 'Метров: ' . $m;

echo '<hr>';

// 2.2 Дана масса в килограммах. Найти число полных центнеров в ней.
echo '<h2>2.2</h2>';
$kg = rand(0,10000);
$centner = $kg / 10;

echo 'Центнеров: ' . $centner;

echo '<hr>';

// 2.3 Дана масса в килограммах. Найти число полных тонн в ней.
echo '<h2>2.3</h2>';
$t = $kg / 1000;
echo 'Тонн: ' . $centner;

echo '<hr>';

// 2.4 Дано расстояние в метрах. Найти число полных километров в нем.
echo '<h2>2.4</h2>';

$m = rand(0, 10000);
$km = $m / 1000;

echo 'Километров: ' . $centner;

echo '<hr>';

// 2.5 С некоторого момента прошло 234 дня. Сколько полных недель прошло за этот период?
echo '<h2>2.5</h2>';
$days = 234;

echo 'Недель: ' . round($days / 7);

echo '<hr>';

// 2.6 С начала суток прошло n секунд. Определить:
echo '<h2>2.6</h2>';
// а) сколько полных часов прошло с начала суток;
$n = rand(0, 86000);

$hours = round($n / 3600);

echo 'Полных часов прошло: ' . $hours;
echo '<br>';
// б) сколько полных минут прошло с начала очередного часа;
$minutes = round(($n % 3600)/60);
echo 'Полных минут прошло: ' . $minutes;
echo '<br>';
// в) сколько полных секунд прошло с начала очередной минуты.
$seconds = round($n % 60);
echo 'Полных секунд прошло: ' . $seconds;








